[{"title": "5 Hidden Gems Are Riding Aboard NASA's Perseverance Rover", "preview": "The symbols, mottos, and small objects added to the agency's newest Mars rover serve a variety of purposes, from functional to decorative."}, {"title": "How NASA's Mars Helicopter Will Reach the Red Planet's Surface", "preview": "The small craft will seek to prove that powered, controlled flight is possible on another planet. But just getting it onto the surface of Mars will take a whole lot of ingenuity."}, {"title": "Virginia Middle School Student Earns Honor of Naming NASA's Next Mars Rover", "preview": "NASA chose a seventh-grader from Virginia as winner of the agency's \"Name the Rover\" essay contest. Alexander Mather's entry for \"Perseverance\" was voted tops among 28,000 entries."}, {"title": "Alabama High School Student Names NASA's Mars Helicopter", "preview": "Vaneeza Rupani's essay was chosen as the name for the small spacecraft, which will mark NASA's first attempt at powered flight on another planet."}, {"title": "New Selfie Shows Curiosity, the Mars Chemist", "preview": "The NASA rover performed a special chemistry experiment at the location captured in its newest self-portrait."}, {"title": "NASA's Mars Helicopter Attached to Mars 2020 Rover", "preview": "The helicopter will be first aircraft to perform flight tests on another planet."}, {"title": "NASA's Mars Rover Drivers Need Your Help", "preview": "Using an online tool to label Martian terrain types, you can train an artificial intelligence algorithm that could improve the way engineers guide the Curiosity rover."}, {"title": "Curiosity Mars Rover's Summer Road Trip Has Begun", "preview": "After more than a year in the \"clay-bearing unit,\" Curiosity is making a mile-long journey around some deep sand so that it can explore higher up Mount Sharp."}, {"title": "What's Mars Solar Conjunction, and Why Does It Matter?", "preview": "NASA spacecraft at Mars are going to be on their own for a few weeks when the Sun comes between Mars and Earth, interrupting communications."}, {"title": "NASA to Broadcast Mars 2020 Perseverance Launch, Prelaunch Activities", "preview": "Starting July 27, news activities will cover everything from mission engineering and science to returning samples from Mars to, of course, the launch itself."}, {"title": "A Martian Roundtrip: NASA's Perseverance Rover Sample Tubes", "preview": "Marvels of engineering, the rover's sample tubes must be tough enough to safely bring Red Planet samples on the long journey back to Earth in immaculate condition."}, {"title": "NASA Administrator Statement on Moon to Mars Initiative, FY 2021 Budget", "preview": "Jim Bridenstine addresses NASA's ambitious plans for the coming years, including Mars Sample Return."}, {"title": "Independent Review Indicates NASA Prepared for Mars Sample Return Campaign", "preview": "NASA released an independent review report Tuesday indicating the agency is well positioned for its Mars Sample Return campaign to bring pristine samples from Mars to Earth for scientific study."}, {"title": "The Launch Is Approaching for NASA's Next Mars Rover, Perseverance", "preview": "The Red Planet's surface has been visited by eight NASA spacecraft. The ninth will be the first that includes a roundtrip ticket in its flight plan."}, {"title": "NASA's Mars 2020 Rover Tests Descent-Stage Separation", "preview": "A crane lifts the rocket-powered descent stage away from NASA's Mars 2020 rover after technicians tested the pyrotechnic charges that separate the two spacecraft."}]